js_project_memory_game_backend/app/controllers/api/v1/games_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "games".* FROM "games"
---
    def index
        @user = User.find_by(id: params[:user_id])
        @games= Game.all