js_project_memory_game_backend/app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "catgirl"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "catgirl"], ["created_at", "2020-07-11 23:14:16.329131"], ["updated_at", "2020-07-11 23:14:16.329131"]]
---
    def create
        if User.find_by(:username => user_params[:username])
            @user = User.find_by(:username => user_params[:username])
            redirect_to "/api/v1/users/#{@user.id}"
        else
            @user = User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def show
        @user = User.find_by(:id => params[:id])